# JAvavavavava
<img width="1397" height="915" alt="Screenshot 2026-01-22 142637" src="https://github.com/user-attachments/assets/87eb3281-b49c-4730-a68d-067dccd921a4" />

Краткий отчёт по программе «Студенты»

Цель работы:
Изучить основы объектно-ориентированного программирования на языке Java, научиться создавать классы, объекты и работать с ними в среде IntelliJ IDEA.

Описание программы:
В ходе работы была разработана программа на языке Java, состоящая из двух классов: Main и Student.
Класс Student предназначен для хранения информации о студенте (имя, возраст, направление обучения, курс).
Класс Main содержит метод main, в котором создаются объекты класса Student и выводится информация о них на экран.

Используемые технологии:

Язык программирования: Java

Среда разработки: IntelliJ IDEA

Основные концепции: классы, объекты, конструкторы, методы, инкапсуляция

Результат работы:
Программа корректно компилируется и запускается, выводя информацию о студентах в консоль. Были устранены ошибки, связанные с именами файлов и настройкой JDK.

Вывод:
В результате выполнения работы были освоены базовые принципы объектно-ориентированного программирования на языке Java и получены практические навыки работы в среде IntelliJ IDEA.
